<template>
  <div>
    <Chart :cdata="cdata" />
  </div>
</template>

<script>
import Chart from './chart.vue'
export default {
  data () {
    return {
      cdata: {
        timeData: [
          "01:00",
          "02:00",
          "03:00",
          "04:00",
          "05:00",
          "06:00",
          "07:00",
          "08:00",
          "09:00",
          "10:00",
          "11:00",
          "12:00",
          "13:00",
          "14:00",
          "15:00",
          "16:00",
          "17:00",
          "18:00",
          "19:00",
          "20:00",
          "21:00",
          "22:00",
          "23:00",
          "24:00",
        ],
        rateData: [
          8.00,
          5.03,
          6.27,
          0.21,
          4.62,
          5.65,
          44.62,
          1.64,
          2.36,
          7.27,
          7.09,
          5.01,
          3.13,
          9.00,
          3.37,
          37.20,
          10.02,
          0.51,
          1.12,
          11.98,
          7.73,
          9.02,
          13.95
        ],
        carbonDioxideData: [
            1012,
            1427,
            1782,
            2072,
            2358,
            2601,
            2288,
            345,
            364,
            693,
            1118,
            1572,
            1955,
            2294,
            2490,
            1090,
            278,
            401,
            328,
            536,
            337,
            368,
            655,
        ],
        methaneData: [
          10.3,
          12.5,
          13.8,
          15.9,
          17.3,
          18.8,
          19.2,
          17.5,
          6.1,
          7.9,
          4.4,
          5,
          5.4,
          6.3,
          6.9,
          7.6,
          8.3,
          8.8,
          9.9,
          11.3,
          12.8,
          13.3,
          13.7,
        ],
        rateData2: [
          0.01,
          0.02,
          0.01,
          0.07,
          0.07,
          0.05,
          0.06,
          0.04,
          0.03,
          0.04,
          0.02,
          0.04,
          0.04,
          0.02,
          0,
          0,
          0.02,
          0.03,
          0.03,
          0.02,
          0,
          0.01,
          0.02
        ],
      }
    };
  },
  components: {
    Chart,
  },
  mounted () {
    // this.setData();
  },
  methods: {
    // 根据自己的业务情况修改
    // setData () {
    //   for (let i = 0; i < this.cdata.barData.length -1; i++) {
    //     let rate = this.cdata.barData[i] / this.cdata.lineData[i];
    //     this.cdata.rateData.push(rate.toFixed(2));
    //   }
    // },
  }
};
</script>

<style lang="scss" scoped>
</style>